
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.AZURE_APPINSIGHTS_KEY_PREVIEW[0]
  * module.adoption-app-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * azurerm_application_insights.appinsights_preview[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights_preview[0] must be replaced
-/+ resource "azurerm_application_insights" "appinsights_preview" {
      ~ app_id                                = "6c71c31d-d6d9-4f45-9d9c-7b334c810009" -> (known after apply)
        application_type                      = "web"
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
        disable_ip_masking                    = false
      ~ id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/adoption-aat/providers/microsoft.insights/components/adoption-appinsights-preview" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
        location                              = "westeurope"
      ~ name                                  = "adoption-appinsights-preview" -> "adoption-aat"
        resource_group_name                   = "adoption-aat"
        retention_in_days                     = 90
        sampling_percentage                   = 100
        tags                                  = {
            "BuiltFrom"           = "https://github.com/HMCTS/adoption-shared-infrastructure.git"
            "application"         = "adoption"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#adoption-tech"
            "environment"         = "staging"
            "managedBy"           = "Adoption"
        }
    }

  # azurerm_key_vault_secret.AZURE_APPINSIGHTS_KEY_PREVIEW[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "AZURE_APPINSIGHTS_KEY_PREVIEW" {
        id           = "https://adoption-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey-Preview-New/8576e523f1484b408358893e2e97ea0c"
        key_vault_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/adoption-aat/providers/Microsoft.KeyVault/vaults/adoption-aat"
        name         = "AppInsightsInstrumentationKey-Preview-New"
        tags         = {}
      ~ value        = (sensitive value)
        version      = "8576e523f1484b408358893e2e97ea0c"
    }

  # module.adoption-app-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/adoption-aat/providers/Microsoft.KeyVault/vaults/adoption-aat|adoption-aat"
        log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        name                       = "adoption-aat"
        target_resource_id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/adoption-aat/providers/Microsoft.KeyVault/vaults/adoption-aat"

        log {
            category = "AuditEvent"
            enabled  = true

            retention_policy {
                days    = 14
                enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":15,"Program":"tfcmt","SHA1":"","Vars":{}} -->